coocox/Mplib/Toshaba/TMPM33x/TMPM332/cmsis_lib/lib/source/tmpm332_cg.c
}

/**
  * @brief  gets the active state of INT source standby clear request
  * @param INTSource: select the release INT source
  *   This parameter can be one of the following values:
  *   CG_INT_SRC_0, CG_INT_SRC_1, CG_INT_SRC_2,
  *   CG_INT_SRC_3, CG_INT_SRC_4, CG_INT_SRC_5(For M330/333),
  *   CG_INT_SRC_CEC_RX(For M330/332), CG_INT_SRC_RMC_RX_0(For M330/332),
  *   CG_INT_SRC_RTC, CG_INT_SRC_6(For M330/333), CG_INT_SRC_7(For M330/333),
  *   CG_INT_SRC_RMC_RX_1(For M330) or CG_INT_SRC_CEC_TX(For M330/332).
  * @retval active state of the input INT
  *   The value returned can be one of the following values:
  *   CG_INT_ACTIVE_STATE_FALLING, CG_INT_ACTIVE_STATE_RISING,
  *   CG_INT_ACTIVE_STATE_BOTH_EDGES or CG_INT_ACTIVE_STATE_INVALID.
  */
CG_INTActiveState CG_GetSTBYReleaseINTState(CG_INTSrc INTSource)
{
    CG_INTActiveState int_active_state = CG_INT_ACTIVE_STATE_INVALID;
    uint32_t mask = (uint32_t) 0x0c;
    uint8_t rightshift_bits = 0U;
    uint32_t regval = 0U;

    /* Check the parameters */
    assert_param(IS_CG_INT_SRC(INTSource));

    switch (INTSource) {
    case CG_INT_SRC_0:
    case CG_INT_SRC_1:
    case CG_INT_SRC_2:
    case CG_INT_SRC_3:
        /* calculate the register offset */
        rightshift_bits = ((uint8_t) INTSource) << 3U;

        regval = TSB_CG->IMCGA;
        regval >>= rightshift_bits;
        regval &= mask;
        break;
    case CG_INT_SRC_4:
#if defined(__TMPM330_CG_H)
    case CG_INT_SRC_5:
    case CG_INT_SRC_CEC_RX:
    case CG_INT_SRC_RMC_RX_0:
#elif defined(__TMPM332_CG_H)
    case CG_INT_SRC_CEC_RX:
    case CG_INT_SRC_RMC_RX_0:
#elif defined(__TMPM333_CG_H)
    case CG_INT_SRC_5:
#endif                          /* End of defined(__TMPM330_CG_H) */
        /* calculate the register offset */
        rightshift_bits = (uint8_t) INTSource - (uint8_t) CG_INT_SRC_4;
        rightshift_bits <<= 3U;

        regval = TSB_CG->IMCGB;
        regval >>= rightshift_bits;
        regval &= mask;
        break;
    case CG_INT_SRC_RTC:
#if defined(__TMPM330_CG_H)
    case CG_INT_SRC_6:
    case CG_INT_SRC_7:
    case CG_INT_SRC_RMC_RX_1:
#elif defined(__TMPM333_CG_H)
    case CG_INT_SRC_6:
    case CG_INT_SRC_7:
#endif                          /* End of defined(__TMPM330_CG_H) */
        /* calculate the register offset */
        rightshift_bits = (uint8_t) INTSource - (uint8_t) CG_INT_SRC_RTC;
        rightshift_bits <<= 3U;

        regval = TSB_CG->IMCGC;
        regval >>= rightshift_bits;
        regval &= mask;
        break;
#if defined(__TMPM330_CG_H)||defined(__TMPM332_CG_H)
    case CG_INT_SRC_CEC_TX:
        regval = TSB_CG->IMCGD & mask;
        break;
#endif
    default:
        /*Do nothing */
        break;
    }

    regval >>= 2U;
    switch (regval) {
    case 0U:
        break;
    case 1U:
        int_active_state = CG_INT_ACTIVE_STATE_RISING;
        break;
    case 2U:
        int_active_state = CG_INT_ACTIVE_STATE_FALLING;
        break;
    case 3U:
        int_active_state = CG_INT_ACTIVE_STATE_BOTH_EDGES;
        break;
    default:
        /*Do nothing */
        break;
    }
    return int_active_state;
}

/**
  * @brief  clears the input INT request.
  * @param INTSource: select the release INT source
  *   This parameter can be one of the following values:
  *   CG_INT_SRC_0, CG_INT_SRC_1, CG_INT_SRC_2,
  *   CG_INT_SRC_3, CG_INT_SRC_4, CG_INT_SRC_5(For M330/333),
  *   CG_INT_SRC_CEC_RX(For M330/332), CG_INT_SRC_RMC_RX_0(For M330/332),
  *   CG_INT_SRC_RTC, CG_INT_SRC_6(For M330/333), CG_INT_SRC_7(For M330/333),
  *   CG_INT_SRC_RMC_RX_1(For M330),CG_INT_SRC_CEC_TX(For M330/332).
  * @retval none
  */
void CG_ClearINTReq(CG_INTSrc INTSource)
{
    uint32_t regval = INTSource;

    /* Check the parameters */
    assert_param(IS_CG_INT_SRC(INTSource));

    TSB_CG->ICRCG = regval;
}

/**
  * @brief  gets the NMI flag that shows who triggered NMI.
  * @param none
  * @retval NMI flag
  */
CG_NMIFactor CG_GetNMIFlag(void)
{
    CG_NMIFactor cg_nmi_factor;
    uint32_t regval = TSB_CG->NMIFLG;
    uint32_t tmp = 0U;

    tmp = regval & (~CG_NMI_FACTOR_PIN_WDT_MASK);
    cg_nmi_factor.All = tmp;
    return cg_nmi_factor;
}

/**
  * @brief  get the type of reset reason and clear the reset flag.
  * @param none
  * @retval reset flag
  */
CG_ResetFlag CG_GetResetFlag(void)
{
    CG_ResetFlag reset_flag ;
    reset_flag.All = TSB_CG->RSTFLG&(~CG_RESET_FLAG_MASK);
    TSB_CG->RSTFLG = 0U;
    return reset_flag;
}

/** @} */
/* End of group CG_Exported_Functions */

/** @} */
/* End of group CG */

/** @} */
/* End of group TX03_Periph_Driver */    
#endif                          /* defined(__TMPM330_CG_H) || defined(__TMPM332_CG_H) || defined(__TMPM333_CG_H) */
